import type { SVGProps } from 'react'

// Figma 758-74944 체크박스 체크마크 (픽셀 스타일, 13x10)
const PixelCheckIcon = (props: SVGProps<SVGSVGElement>) => {
  return (
    <svg
      width="13"
      height="10"
      viewBox="0 0 13 10"
      fill="none"
      xmlns="http://www.w3.org/2000/svg"
      {...props}
    >
      <path
        d="M1.56348 6.87305L1.56348 8.43652L3.12695 8.43652L3.12695 10L5.21094 10L5.21094 8.43652L6.77344 8.43652L6.77344 6.87305L8.33691 6.87305L8.33691 5.27637L9.86328 5.27637L9.86328 3.68066L11.3906 3.68066L11.3906 2.08398L12.918 2.08398L12.918 0L10.834 0L10.834 1.5957L9.30664 1.5957L9.30664 3.19238L7.7793 3.19238L7.7793 4.78906L6.25293 4.78906L6.25293 6.35254L4.68945 6.35254L4.68945 7.91504L3.64746 7.91504L3.64746 6.35254L2.08398 6.35254L2.08398 4.78906L0 4.78906L0 6.87305L1.56348 6.87305Z"
        fill="currentColor"
      />
    </svg>
  )
}

export { PixelCheckIcon }
